import numpy as np

#--------------------射場のパラメーター----------------#
#シミュレータを回す前に必要に応じてこの中のパラメータを編集してください

#射点
#1:大島陸
oshima_land_LLH = np.array([34.735972,139.420944, 0.0])
#2:大島海
oshima_sea_LLH = np.array([34.679730, 139.438373, 0.0])
#3:能代陸
noshiro_land_LLH = np.array([40.138633, 139.984850, 0.0])
#4:能代海
noshiro_sea_LLH = np.array([40.242865, 140.010450, 5.3])

#----保安域など-----#
#1:大島陸
#落下地点高度(基本陸なら射点の高度と一致するか)
oshima_land_height_landing = oshima_land_LLH[2]
# 落下保安域
oshima_land_safety_LLH = np.array([[34.735715, 139.420922, 20.0],
                                   [34.731750, 139.421719, 20.0],
                                   [34.733287, 139.424590, 20.0],
                                   [34.736955, 139.426038, 20.0],
                                   [34.738908, 139.423597, 20.0],
                                   [34.740638, 139.420681, 20.0],
                                   [34.741672, 139.417387, 20.0]])
# 本部
oshima_land_headquarters_LLH = np.array([34.731230, 139.423150, 0.0])
# 点火点
oshima_land_fire_LLH = np.array([34.735390,139.421377, 0.0])

#2:大島海
#落下地点高度(海なら0)
oshima_sea_height_landing = 0.0
# 保安円の中心
oshima_sea_center_circle_LLH = np.array([34.661857, 139.454987, 5.0])
# 保安円半径[m]
oshima_sea_center_circle_radius = 2500
# 境界線端点
oshima_sea_edge1_LLH = np.array([34.684392, 139.454677, 1.0])
oshima_sea_edge2_LLH = np.array([34.667917, 139.428718, 1.0])

#3:能代陸
#落下地点高度(基本陸なら射点の高度と一致するか)
noshiro_land_height_landing = noshiro_land_LLH[2]
# 落下保安域
noshiro_land_safety_LLH = np.array([[40.139725, 139.983939, 20.0],
                                    [40.136127, 139.982133, 20.0],
                                    [40.135607, 139.981753, 20.0],
                                    [40.134911, 139.981451, 20.0],
                                    [40.134821, 139.981692, 20.0],
                                    [40.135639, 139.983324, 20.0],
                                    [40.137052, 139.984608, 20.0],
                                    [40.138053, 139.985781, 20.0],
                                    [40.139075, 139.986297, 20.0]])

#4:能代海
#落下地点高度(海なら0)
noshiro_sea_height_landing = 0.0
# 保安円中心
noshiro_sea_center_circle_LLH = np.array([40.24680277, 139.98753611, 5.0])
# 保安円半径[m]
noshiro_sea_center_circle_radius = 2000
# 境界線端点
noshiro_sea_edge1_LLH = np.array([40.243015, 140.007566, 1.0])
noshiro_sea_edge2_LLH = np.array([40.235585, 140.005619, 1.0])
#---------------------------------------------------------------------------#